In [1]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series(['일','이','삼','사','오'],
                  index=range(1,6))
series

1    일
2    이
3    삼
4    사
5    오
dtype: object

In [3]:
s = pd.Series([9_904_312, 3448737, 2890451, 2466052],
             index=['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
n = pd.Series([10,20,30,40,50,60,70,80,90],
             index=[0,1,2,3,4,5,6,7,8])
n

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
n = pd.Series([10,20,30,40,50,60,70,80,90])
n

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [6]:
result = n.values
sum(result>50)

4

In [8]:
s.name

In [9]:
d = {'a':1, 'b':2,'c':3}
ser = pd.Series(d,['c','a','b'])
ser

c    3
a    1
b    2
dtype: int64

In [10]:
a = {'철수':88,'영희':95, '길동':100, '몽룡':67}
b = pd.Series(a)
b

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [11]:
a = pd.Series([88,95,100,67],
             ['철수', '영희', '길동','몽룡'])
a

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [12]:
a = {'철수':88,'영희':95, '길동':100, '몽룡':67}
b = pd.Series(a)
b['철수']

88

In [13]:
'영희' in b

True

In [14]:
95 in a.values()

True

In [15]:
for k, v in b.items():
    print(f"{k},{v}")

철수,88
영희,95
길동,100
몽룡,67

In [16]:
dic = pd.Series({'서울':9_904_312, '부산':3448737, 인천})
for k, v in dic.items():
    
    print(f'{k}의 인구는 {v}만이 넘습니다.')

SyntaxError: invalid syntax (2442443950.py, line 1)

In [17]:
s = pd.Series([9_904_312, 3448737, 2890451, 2466052],
             index=['서울', '부산', '인천', '대구'])
s.items

<bound method Series.items of 서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64>

In [18]:
s = pd.Series({'서울':9_904_312, '부산':3448737, '인천':2890451, '대구':2466052})

for k, v in s.items():
    if v>3_000_000:
        print(f'{k}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [19]:
s = pd.Series({'서울':9_904_312, '부산':3448737, '인천':2890451, '대구':2466052})

s[['인천']]

인천    2890451
dtype: int64

In [20]:
# 무자는 끝도 포함
s['서울':'인천']

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [21]:
np.nan - 20

nan

In [22]:
ds = s2-s
ds

NameError: name 's2' is not defined

In [23]:
s = pd.Series({'서울':9_904_312, '부산':3448737, '인천':2890451, '대구':2466052})
s2 = pd.Series({'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158})

print(s)
print(s2)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [24]:
import numpy as np
# a = s-s2
# a

In [25]:
a = s-s2

In [28]:
s = pd.Series({'서울':9_904_312, '부산':3448737, '인천':2890451, '대구':2466052})
s2 = pd.Series({'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158})

rs = (s-s2)/s2*100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [34]:
s = pd.Series({'서울':9_904_312, '부산':3448737, '인천':2890451, '대구':2466052})
s2 = pd.Series({'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158})

rs = s-s2
rs = rs[rs.notnull()]
rs[[rs.argmax()]]

서울    272830.0
dtype: float64

In [49]:
rs[:3] = 1.63,2.83,9.82
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [50]:
rs['부산','서울','인천'] = 1.63,2.83,9.82
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [53]:
rs['대구'] = 2.2

In [58]:
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [82]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자":90000}
ser_finance1 = pd.Series(fin1)
print(ser_finance1)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [65]:
fin2_value = [60200,61200,200100]
fin2_index = ["카카오", "삼성전자","네이버"]
ser_finance2 = pd.Series(fin2_value,fin2_index)

In [75]:
ser_finance1 - ser_finance2
# LG전자      NaN
# 네이버       NaN
# 삼성전자   -200.0
# 카카오    -190.0
# dtype: float64

ser_finance1 + ser_finance2
# LG전자         NaN
# 네이버          NaN
# 삼성전자    122200.0
# 카카오     120210.0
# dtype: float64

ser_finance1 * ser_finance2
# LG전자             NaN
# 네이버              NaN
# 삼성전자    3.733200e+09
# 카카오     3.612602e+09
# dtype: float64

ser_finance1 / ser_finance2
# LG전자         NaN
# 네이버          NaN
# 삼성전자    0.996732
# 카카오     0.996844
# dtype: float64

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [84]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [86]:
d = {'coll': [1,2], 'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   coll  col2
0     1     3
1     2     4

In [95]:
df.index.name = "도시"

In [90]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [96]:
df.columns.name = '특성'

In [97]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [104]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

문화재 총계   지역     2015     2010     2005     2000  2010-2015 증가율
서울      수도권  9904312  9631482  9762546  9853972         0.0283
부산      경상권  3448737  3393191  3512547  3655437         0.0163
인천      수도권  2890451  2632035  2517680  2466338         0.0982
대구      경상권  2466052  2431774  2456016  2473990         0.0141

In [100]:
data = {
    "서울": [168,716,11,31],
    "부산": [6,54,7,5],
    "인천": [1,29,13,5],
    "문화재유형": ['국보','보물','천연기념물','국가무형문화재']
}    
columns = ["문화재유형", "서울", "부산", "인천"]
index = ["2020", "2020", "2020", "2020"]
df = pd.DataFrame(data, index = index, columns = columns)
df

        문화재유형   서울  부산  인천
2020       국보  168   6   1
2020       보물  716  54  29
2020    천연기념물   11   7  13
2020  국가무형문화재   31   5   5

In [129]:
data = {
    "2017": [1195,89,99,74],
    "2018": [1224,93,103,76],
    "2019": [1242,98,108,75],
    "지역":["수도권","경상권","수도권","경상권"],
    "2017-2019 증가율":[0.0378,0.0918,0.0833,0.0133]
}    
columns = ['지역','2017','2018','2019',"2017-2019 증가율"]
index = ["서울","부산","대구","인천"]
df = pd.DataFrame(data, index = index, columns = columns)
df.columns.name = '문화재 총계'
df.index.name = '도시'

df["2017-2019 증가율"] = df["2017-2019 증가율"]*100
df["2019-2017 증가율"] = ((df['2019']-df['2017'])/df['2017']*100).round(2)
del df["2019-2017 증가율"]
df['2017']['서울']

1195

In [130]:
type(df['2019'])

pandas.core.series.Series

In [160]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

# 모든 학생의 수학 점수를 Series로 나타낸다.
df["수학"]

# 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균 점수'] = ((df['국어']+df['영어']+df['수학'])/3).round(2)

# 춘향의 점수를 DataFrame으로 나타낸다.
df['춘향':'춘향']

# 향단의 점수를 Series로 나타낸다.
df.T['향단']
df.loc['향단']

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [161]:
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [165]:
np.random.seed(0)
a = np.random.randn(6,4)
columns = ['A','B','C','D']
index = pd.date_range('20130226', periods=6)

df = pd.DataFrame(a, index=index, columns=columns)
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165